tylertms/kinetis-k22-sim/tests/architecture/cortex_m4/execution/thumb32_test.c
#include "kinetis.h"

#include <stdint.h>

#include "architecture/cortex_m4/internal.h"
#include "test.h"

typedef struct {
    TestState* state;
    Kinetis* device;
    CortexM4* cpu;
} Fixture;

static void execute(Fixture* fixture, uint16_t first, uint16_t second) {
    fixture->cpu->registers[15] = 0x104u;
    expect(fixture->state, cortex_m4_execute_thumb32(fixture->cpu, first, second),
           "cortex_m4_execute_thumb32(fixture->cpu, first, second)");
}

static void test_branches(Fixture* fixture) {
    execute(fixture, 0xf000u, 0xf800u);
    expect(fixture->state, fixture->cpu->registers[14] == 0x105u,
           "fixture->cpu->registers[14] == 0x105u");
    expect(fixture->state, fixture->cpu->registers[15] == 0x104u,
           "fixture->cpu->registers[15] == 0x104u");
    execute(fixture, 0xf000u, 0xb800u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x104u,
           "fixture->cpu->registers[15] == 0x104u");
    fixture->cpu->xpsr |= CORTEX_M4_XPSR_Z;
    execute(fixture, 0xf000u, 0x8000u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x104u,
           "fixture->cpu->registers[15] == 0x104u");
    fixture->cpu->xpsr &= ~CORTEX_M4_XPSR_Z;
    execute(fixture, 0xf000u, 0x8002u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x104u,
           "fixture->cpu->registers[15] == 0x104u");
    fixture->cpu->xpsr = CORTEX_M4_XPSR_T | CORTEX_M4_XPSR_C;
    execute(fixture, 0xf200u, 0x8097u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x232u,
           "fixture->cpu->registers[15] == 0x232u");
}

static void test_branch_decode_precedence(Fixture* fixture) {
    uint64_t branch_count = 0u;
    bool overlap = false;
    for (uint32_t first = 0xf000u; first <= 0xf7ffu && !overlap; first++) {
        const uint32_t condition = (first >> 6u) & 15u;
        for (uint32_t second = 0u; second <= UINT16_MAX; second++) {
            const uint32_t branch = second & 0xd000u;
            if (branch != 0xd000u && branch != 0x9000u && (branch != 0x8000u || condition >= 14u)) {
                continue;
            }
            branch_count++;
            overlap =
                cortex_m4_execute_remaining(fixture->cpu, (uint16_t)first, (uint16_t)second) ||
                cortex_m4_execute_thumb32_extra(fixture->cpu, (uint16_t)first, (uint16_t)second) ||
                cortex_m4_execute_dsp(fixture->cpu, (uint16_t)first, (uint16_t)second);
            if (overlap) {
                break;
            }
        }
    }
    expect(fixture->state, branch_count == UINT64_C(48234496),
           "branch_count == UINT64_C(48234496)");
    expect(fixture->state, !overlap, "no earlier decoder accepts a branch encoding");
}

static void test_special_registers(Fixture* fixture) {
    fixture->cpu->xpsr = CORTEX_M4_XPSR_T | CORTEX_M4_XPSR_N | CORTEX_M4_XPSR_C | 7u;
    fixture->cpu->msp = 0x20001000u;
    fixture->cpu->psp = 0x20002000u;
    fixture->cpu->primask = 1u;
    fixture->cpu->basepri = 0x80u;
    fixture->cpu->faultmask = 1u;
    fixture->cpu->control = 3u;
    const uint8_t selectors[] = {0u, 1u, 2u, 3u, 5u, 6u, 7u, 8u, 9u, 16u, 17u, 18u, 19u, 20u, 31u};
    const uint32_t expected[] = {0xa0000000u, 0xa0000007u, 0x01000000u, 0xa1000007u, 7u,
                                 0x01000000u, 0x01000007u, 0x20001000u, 0x20002000u, 1u,
                                 0x80u,       0x80u,       1u,          3u,          0u};
    for (size_t index = 0u; index < sizeof(selectors); index++) {
        execute(fixture, 0xf3efu, (uint16_t)(0x8000u | selectors[index]));
        expect(fixture->state, fixture->cpu->registers[0] == expected[index],
               "fixture->cpu->registers[0] == expected[index]");
    }

    fixture->cpu->registers[1] = 0xa00000f7u;
    const uint8_t write_selectors[] = {0u, 8u, 9u, 16u, 17u, 18u, 19u, 20u};
    for (size_t index = 0u; index < sizeof(write_selectors); index++)
        execute(fixture, 0xf381u, (uint16_t)(0x8800u | write_selectors[index]));
    expect(fixture->state, fixture->cpu->msp == 0xa00000f4u, "fixture->cpu->msp == 0xa00000f4u");
    expect(fixture->state, fixture->cpu->psp == 0xa00000f4u, "fixture->cpu->psp == 0xa00000f4u");
    expect(fixture->state, fixture->cpu->primask == 1u, "fixture->cpu->primask == 1u");
    expect(fixture->state, fixture->cpu->basepri == 0xf0u, "fixture->cpu->basepri == 0xf0u");
    expect(fixture->state, fixture->cpu->faultmask == 1u, "fixture->cpu->faultmask == 1u");
    expect(fixture->state, fixture->cpu->control == 7u, "fixture->cpu->control == 7u");

    fixture->cpu->control = 0u;
    fixture->cpu->basepri = 0xf0u;
    fixture->cpu->registers[1] = 0x80u;
    execute(fixture, 0xf381u, 0x8812u);
    expect(fixture->state, fixture->cpu->basepri == 0x80u, "fixture->cpu->basepri == 0x80u");

    fixture->cpu->xpsr = CORTEX_M4_XPSR_T;
    fixture->cpu->control = CORTEX_M4_CONTROL_NPRIV;
    fixture->cpu->registers[1] = 0u;
    execute(fixture, 0xf381u, 0x8810u);
    expect(fixture->state, fixture->cpu->primask == 1u, "fixture->cpu->primask == 1u");
    fixture->cpu->control = 0u;
}

static void test_armv6_special_registers(Fixture* fixture) {
    expect(fixture->state,
           cortex_m4_configure_architecture(fixture->cpu, CORTEX_M4_ARCHITECTURE_ARMV6_M),
           "configure ARMv6-M special-register behavior");
    fixture->cpu->xpsr = CORTEX_M4_XPSR_T | CORTEX_M4_XPSR_N | CORTEX_M4_XPSR_C |
                         CORTEX_M4_XPSR_Q | 7u;
    fixture->cpu->control = 0u;
    const uint8_t selectors[] = {0u, 1u, 2u, 3u, 5u, 6u, 7u};
    const uint32_t expected[] = {0xa8000000u, 0xa8000007u, 0xa8000000u, 0xa8000007u,
                                 7u,          0u,          7u};
    for (size_t index = 0u; index < sizeof(selectors); index++) {
        execute(fixture, 0xf3efu, (uint16_t)(0x8000u | selectors[index]));
        expect(fixture->state, fixture->cpu->registers[0] == expected[index],
               "ARMv6-M MRS returns only implemented status fields");
    }
    fixture->cpu->xpsr = CORTEX_M4_XPSR_T;
    fixture->cpu->control = CORTEX_M4_CONTROL_NPRIV;
    const uint8_t privileged_selectors[] = {1u, 2u, 3u, 5u, 6u, 7u, 8u, 9u, 16u};
    for (size_t index = 0u; index < sizeof(privileged_selectors); index++) {
        execute(fixture, 0xf3efu, (uint16_t)(0x8000u | privileged_selectors[index]));
        expect(fixture->state, fixture->cpu->registers[0] == 0u,
               "unprivileged ARMv6-M MRS hides privileged registers");
    }
    execute(fixture, 0xf3efu, 0x8014u);
    expect(fixture->state, fixture->cpu->registers[0] == CORTEX_M4_CONTROL_NPRIV,
           "unprivileged ARMv6-M MRS exposes CONTROL");
    fixture->cpu->xpsr = CORTEX_M4_XPSR_T | 3u;
    fixture->cpu->control = CORTEX_M4_CONTROL_SPSEL;
    fixture->cpu->registers[1] = 0u;
    execute(fixture, 0xf381u, 0x8814u);
    expect(fixture->state, fixture->cpu->control == CORTEX_M4_CONTROL_SPSEL,
           "Handler-mode ARMv6-M MSR preserves CONTROL.SPSEL");
    fixture->cpu->registers[1] = CORTEX_M4_XPSR_Q;
    execute(fixture, 0xf381u, 0x8800u);
    expect(fixture->state, (fixture->cpu->xpsr & CORTEX_M4_XPSR_Q) != 0u,
           "ARMv6-M MSR writes APSR.Q");
    expect(fixture->state,
           cortex_m4_configure_architecture(fixture->cpu, CORTEX_M4_ARCHITECTURE_ARMV7E_M),
           "restore ARMv7E-M architecture");
    fixture->cpu->xpsr = CORTEX_M4_XPSR_T;
    fixture->cpu->control = 0u;
}

static void test_immediates(Fixture* fixture) {
    execute(fixture, 0xf240u, 0x0101u);
    expect(fixture->state, fixture->cpu->registers[1] == 1u, "fixture->cpu->registers[1] == 1u");
    execute(fixture, 0xf2c1u, 0x2100u);
    expect(fixture->state, fixture->cpu->registers[1] == 0x12000001u,
           "fixture->cpu->registers[1] == 0x12000001u");

    const uint16_t immediates[] = {0x0012u, 0x1012u, 0x2012u, 0x3012u, 0x4001u};
    const uint32_t expected[] = {0x00000012u, 0x00120012u, 0x12001200u, 0x12121212u, 0x81000000u};
    for (size_t index = 0u; index < sizeof(immediates) / sizeof(immediates[0]); index++) {
        fixture->cpu->registers[1] = 0u;
        execute(fixture, 0xf041u, immediates[index]);
        expect(fixture->state, fixture->cpu->registers[0] == expected[index],
               "fixture->cpu->registers[0] == expected[index]");
    }

    const uint8_t operations[] = {0u, 1u, 3u, 10u, 11u, 13u, 14u};
    for (size_t index = 0u; index < sizeof(operations); index++) {
        fixture->cpu->registers[1] = 5u;
        fixture->cpu->xpsr |= CORTEX_M4_XPSR_C;
        execute(fixture, (uint16_t)(0xf001u | ((uint16_t)operations[index] << 5u)), 1u);
        expect(fixture->state, fixture->cpu->registers[0] != 0xdeadbeefu,
               "fixture->cpu->registers[0] != 0xdeadbeefu");
    }

    fixture->cpu->registers[1] = 0x121u;
    execute(fixture, 0xf041u, 0x0f00u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x120u,
           "fixture->cpu->registers[15] == 0x120u");
}

static void test_arithmetic(Fixture* fixture) {
    fixture->cpu->registers[1] = 10u;
    fixture->cpu->registers[2] = 3u;
    execute(fixture, 0xfb91u, 0xf0f2u);
    expect(fixture->state, fixture->cpu->registers[0] == 3u, "fixture->cpu->registers[0] == 3u");
    execute(fixture, 0xfbb1u, 0xf0f2u);
    expect(fixture->state, fixture->cpu->registers[0] == 3u, "fixture->cpu->registers[0] == 3u");

    fixture->cpu->ccr = 0u;
    fixture->cpu->registers[2] = 0u;
    execute(fixture, 0xfbb1u, 0xf0f2u);
    expect(fixture->state, fixture->cpu->registers[0] == 0u, "fixture->cpu->registers[0] == 0u");
    fixture->cpu->ccr = 1u << 4u;
    fixture->cpu->cfsr = 0u;
    execute(fixture, 0xfbb1u, 0xf0f2u);
    expect(fixture->state, (fixture->cpu->cfsr & (1u << 25u)) != 0u,
           "(fixture->cpu->cfsr & (1u << 25u)) != 0u");
    fixture->cpu->system_pending = 0u;
    fixture->cpu->ccr = 0u;

    fixture->cpu->registers[1] = 0x80000000u;
    fixture->cpu->registers[2] = UINT32_MAX;
    execute(fixture, 0xfb91u, 0xf0f2u);
    expect(fixture->state, fixture->cpu->registers[0] == 0x80000000u,
           "fixture->cpu->registers[0] == 0x80000000u");

    fixture->cpu->registers[1] = 7u;
    fixture->cpu->registers[2] = 6u;
    fixture->cpu->registers[3] = 5u;
    execute(fixture, 0xfb01u, 0x3002u);
    expect(fixture->state, fixture->cpu->registers[0] == 47u, "fixture->cpu->registers[0] == 47u");

    fixture->cpu->registers[1] = UINT32_MAX;
    fixture->cpu->registers[2] = 2u;
    execute(fixture, 0xfb81u, 0x0302u);
    expect(fixture->state, fixture->cpu->registers[0] == 0xfffffffeu,
           "fixture->cpu->registers[0] == 0xfffffffeu");
    expect(fixture->state, fixture->cpu->registers[3] == UINT32_MAX,
           "fixture->cpu->registers[3] == UINT32_MAX");
    execute(fixture, 0xfba1u, 0x0302u);
    expect(fixture->state, fixture->cpu->registers[0] == 0xfffffffeu,
           "fixture->cpu->registers[0] == 0xfffffffeu");
    expect(fixture->state, fixture->cpu->registers[3] == 1u, "fixture->cpu->registers[3] == 1u");

    fixture->cpu->registers[0] = 1u;
    fixture->cpu->registers[3] = 0u;
    execute(fixture, 0xfbc1u, 0x0302u);
    expect(fixture->state, fixture->cpu->registers[0] == UINT32_MAX,
           "fixture->cpu->registers[0] == UINT32_MAX");
    execute(fixture, 0xfbe1u, 0x0302u);
    expect(fixture->state, fixture->cpu->registers[0] == 0xfffffffdu,
           "fixture->cpu->registers[0] == 0xfffffffdu");

    fixture->cpu->registers[1] = 0x12345678u;
    execute(fixture, 0xf3c1u, 0x001fu);
    expect(fixture->state, fixture->cpu->registers[0] == 0x12345678u,
           "fixture->cpu->registers[0] == 0x12345678u");
    fixture->cpu->registers[1] = 0x80u;
    execute(fixture, 0xf341u, 0x0007u);
    expect(fixture->state, fixture->cpu->registers[0] == 0xffffff80u,
           "fixture->cpu->registers[0] == 0xffffff80u");
}

static void test_memory_and_exclusive(Fixture* fixture) {
    const uint32_t address = 0x20000100u;
    uint16_t halfword = 0x1234u;
    uint8_t byte = 0x5au;
    expect(fixture->state, kinetis_write(fixture->device, address, &halfword, sizeof(halfword)),
           "kinetis_write(fixture->device, address, &halfword, sizeof(halfword))");
    expect(fixture->state, kinetis_write(fixture->device, address + 2u, &byte, sizeof(byte)),
           "kinetis_write(fixture->device, address + 2u, &byte, sizeof(byte))");
    fixture->cpu->registers[1] = address + 2u;
    execute(fixture, 0xe8d1u, 0x0f4fu);
    expect(fixture->state, fixture->cpu->registers[0] == byte,
           "fixture->cpu->registers[0] == byte");
    fixture->cpu->registers[2] = 0xa5u;
    execute(fixture, 0xe8c1u, 0x2f40u);
    expect(fixture->state, fixture->cpu->registers[0] == 0u, "fixture->cpu->registers[0] == 0u");
    expect(fixture->state, kinetis_read(fixture->device, address + 2u, &byte, sizeof(byte)),
           "kinetis_read(fixture->device, address + 2u, &byte, sizeof(byte))");
    expect(fixture->state, byte == 0xa5u, "byte == 0xa5u");

    const uint32_t branch = 0x121u;
    expect(fixture->state, kinetis_load(fixture->device, 0x104u, &branch, sizeof(branch)),
           "kinetis_load(fixture->device, 0x104u, &branch, sizeof(branch))");
    execute(fixture, 0xf8dfu, 0xf000u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x120u,
           "fixture->cpu->registers[15] == 0x120u");

    fixture->cpu->registers[1] = address;
    fixture->cpu->registers[0] = 0x11223344u;
    execute(fixture, 0xf8c1u, 0x0000u);
    uint32_t word = 0u;
    expect(fixture->state, kinetis_read(fixture->device, address, &word, sizeof(word)),
           "kinetis_read(fixture->device, address, &word, sizeof(word))");
    expect(fixture->state, word == 0x11223344u, "word == 0x11223344u");
    fixture->cpu->registers[1] = address + 3u;
    execute(fixture, 0xf991u, 0x0000u);
    expect(fixture->state, fixture->cpu->registers[0] == 0x11u,
           "fixture->cpu->registers[0] == 0x11u");

    byte = 0x80u;
    expect(fixture->state, kinetis_write(fixture->device, address + 1u, &byte, sizeof(byte)),
           "kinetis_write(fixture->device, address + 1u, &byte, sizeof(byte))");
    fixture->cpu->registers[1] = address;
    execute(fixture, 0xf911u, 0x0701u);
    expect(fixture->state, fixture->cpu->registers[0] == 0xffffff80u,
           "fixture->cpu->registers[0] == 0xffffff80u");
    expect(fixture->state, fixture->cpu->registers[1] == address + 1u,
           "fixture->cpu->registers[1] == address + 1u");
    execute(fixture, 0xf891u, 0xf000u);

    fixture->cpu->registers[0] = 0x01020304u;
    fixture->cpu->registers[2] = 0x11121314u;
    fixture->cpu->registers[4] = address + 0x20u;
    execute(fixture, 0xe8a4u, 0x0005u);
    expect(fixture->state, fixture->cpu->registers[4] == address + 0x28u,
           "fixture->cpu->registers[4] == address + 0x28u");
    fixture->cpu->registers[0] = 0u;
    fixture->cpu->registers[2] = 0u;
    fixture->cpu->registers[4] = address + 0x20u;
    execute(fixture, 0xe8b4u, 0x0005u);
    expect(fixture->state, fixture->cpu->registers[0] == 0x01020304u,
           "fixture->cpu->registers[0] == 0x01020304u");
    expect(fixture->state, fixture->cpu->registers[2] == 0x11121314u,
           "fixture->cpu->registers[2] == 0x11121314u");
    execute(fixture, 0xf3bfu, 0x8f2fu);
    expect(fixture->state, !fixture->cpu->exclusive_valid, "!fixture->cpu->exclusive_valid");

    fixture->cpu->registers[4] = address + 0x20u;
    fixture->cpu->ici_valid = true;
    fixture->cpu->ici_register = 2u;
    fixture->cpu->ici_address = address + 0x24u;
    fixture->cpu->registers[2] = 0u;
    execute(fixture, 0xe8b4u, 0x0005u);
    expect(fixture->state, fixture->cpu->registers[2] == 0x11121314u,
           "fixture->cpu->registers[2] == 0x11121314u");
    expect(fixture->state, !fixture->cpu->ici_valid, "!fixture->cpu->ici_valid");

    fixture->cpu->registers[4] = 0x60000000u;
    fixture->cpu->cfsr = 0u;
    execute(fixture, 0xe8b4u, 0x0001u);
    expect(fixture->state, (fixture->cpu->cfsr & (1u << 9u)) != 0u,
           "(fixture->cpu->cfsr & (1u << 9u)) != 0u");
    fixture->cpu->system_pending = 0u;

    fixture->cpu->registers[1] = address;
    const uint32_t target = 0x181u;
    expect(fixture->state, kinetis_write(fixture->device, address + 4u, &target, sizeof(target)),
           "kinetis_write(fixture->device, address + 4u, &target, sizeof(target))");
    execute(fixture, 0xf851u, 0xf704u);
    expect(fixture->state, fixture->cpu->registers[15] == 0x180u,
           "fixture->cpu->registers[15] == 0x180u");
    expect(fixture->state, fixture->cpu->registers[1] == address + 4u,
           "fixture->cpu->registers[1] == address + 4u");

    fixture->cpu->registers[1] = 0x60000000u;
    fixture->cpu->cfsr = 0u;
    execute(fixture, 0xf851u, 0x0700u);
    expect(fixture->state, (fixture->cpu->cfsr & (1u << 9u)) != 0u,
           "(fixture->cpu->cfsr & (1u << 9u)) != 0u");
    fixture->cpu->system_pending = 0u;
}

int main(void) {
    TestState state = {0};
    KinetisConfiguration configuration = kinetis_configuration(KINETIS_PROFILE_MK22FN51212);
    configuration.flash_size = 4096u;
    configuration.sram_size = 65536u;
    Kinetis* device = kinetis_create(configuration);
    expect(&state, device != NULL, "device != NULL");
    const uint32_t vectors[2] = {0x20001000u, 0x101u};
    expect(&state, kinetis_load(device, 0u, vectors, sizeof(vectors)),
           "kinetis_load(device, 0u, vectors, sizeof(vectors))");
    expect(&state, kinetis_reset(device), "kinetis_reset(device)");
    Fixture fixture = {&state, device, kinetis_cpu(device)};
    test_branches(&fixture);
    test_branch_decode_precedence(&fixture);
    test_special_registers(&fixture);
    test_armv6_special_registers(&fixture);
    test_immediates(&fixture);
    test_arithmetic(&fixture);
    test_memory_and_exclusive(&fixture);
    kinetis_destroy(device);
    return test_finish(&state);
}
